Masmiseim36/nxpSDK/devices/MIMXRT735S/MIMXRT735S_cm33_core1.xml
        <register>
          <name>SRAM_CLKGATE_CTRL</name>
          <description>SRAM Clock Gating Control</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PARTITION18</name>
              <description>Partition 18</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PARTITION18_0</name>
                  <description>Bus clock input gated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PARTITION18_1</name>
                  <description>No effects</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PARTITION19</name>
              <description>Partition 19</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PARTITION19_0</name>
                  <description>Bus clock input gated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PARTITION19_1</name>
                  <description>No effects</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PARTITION20</name>
              <description>Partition 20</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PARTITION20_0</name>
                  <description>Bus clock input gated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PARTITION20_1</name>
                  <description>No effects</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PARTITION21</name>
              <description>Partition 21</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PARTITION21_0</name>
                  <description>Bus clock input gated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PARTITION21_1</name>
                  <description>No effects</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PARTITION22</name>
              <description>Partition 22</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PARTITION22_0</name>
                  <description>Bus clock input gated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PARTITION22_1</name>
                  <description>No effects</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PARTITION23</name>
              <description>Partition 23</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PARTITION23_0</name>
                  <description>Bus clock input gated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PARTITION23_1</name>
                  <description>No effects</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PARTITION24</name>
              <description>Partition 24</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PARTITION24_0</name>
                  <description>Bus clock input gated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PARTITION24_1</name>
                  <description>No effects</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PARTITION25</name>
              <description>Partition 25</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PARTITION25_0</name>
                  <description>Bus clock input gated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PARTITION25_1</name>
                  <description>No effects</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PARTITION26</name>
              <description>Partition 26</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PARTITION26_0</name>
                  <description>Bus clock input gated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PARTITION26_1</name>
                  <description>No effects</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PARTITION27</name>
              <description>Partition 27</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PARTITION27_0</name>
                  <description>Bus clock input gated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PARTITION27_1</name>
                  <description>No effects</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PARTITION28</name>
              <description>Partition 28</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PARTITION28_0</name>
                  <description>Bus clock input gated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PARTITION28_1</name>
                  <description>No effects</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PARTITION29</name>
              <description>Partition 29</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PARTITION29_0</name>
                  <description>Bus clock input gated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PARTITION29_1</name>
                  <description>No effects</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SENSE_AUTOGATE_EN</name>
          <description>VDD1_SENSE Auto Gating Enable</description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MATRIX_EN</name>
              <description>Automatic Clock Gating Enable for S-Bus</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables clock gating (continuous clock)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables clock gating</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BRIDGE_EN</name>
              <description>Automatic Clock Gating Enable for AHB to APB Bridge, AIPS and AXBS</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables clock gating (continuous clock)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables clock gating</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TEMPDETECT_CTRL[%s]</name>
          <description>TEMPDETECTtempdetect_i Control</description>
          <addressOffset>0x514</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>TEMPDETECT0 Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Not_enable</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEMPSEL</name>
              <description>TEMPDETECT0 Temperature Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TEMPSEL_0</name>
                  <description>See .</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEMPSEL_1</name>
                  <description>See .</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEMPSEL_2</name>
                  <description>See .</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEMPSEL_3</name>
                  <description>See .</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEMPSEL_4</name>
                  <description>See .</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEMPSEL_5</name>
                  <description>See .</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEMPSEL_6</name>
                  <description>See .</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEMPSEL_7</name>
                  <description>See .</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEMPSEL_8</name>
                  <description>See .</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEMPSEL_9</name>
                  <description>See .</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEMP0_HIGH_DETECT</name>
              <description>TEMPDETECT0 High Or Low Detection</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Below</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Above</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTERRUPT_CLEAR</name>
              <description>TEMPDETECT0 Interrupt Clear</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not_care</name>
                  <description>Not clear</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clear</name>
                  <description>Clears</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMPDETECT_FLAGS</name>
          <description>TEMPDETECT Interrupts Output</description>
          <addressOffset>0x51C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TEMPDETECT0</name>
              <description>TEMPDETECT0 Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_INTERRUPT</name>
                  <description>No Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEMPDETECT1</name>
              <description>TEMPDETECT1 Interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_INTERRUPT</name>
                  <description>No Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMPDETECT_INT_EN</name>
          <description>TEMPDETECT Interrupts Enable</description>
          <addressOffset>0x600</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TEMPDETECT0_INT_EN</name>
              <description>TEMPDETECT0 Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEMPDETECT1_INT_EN</name>
              <description>TEMPDETECT1 Interrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SWD_ACCESS_CPU[%s]</name>
          <description>CPUcpu_i Software Debug Access</description>
          <addressOffset>0x800</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_CODE</name>
              <description>CPU SWD-AP: 12345678h</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>CPU DAP is not allowed. Reading back register will be read as 5h</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Value to write to enable CPU SWD access. Reading back register will be read as Ah</description>
                  <value>0x12345678</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SWD_ACCESS_APBAP</name>
          <description>APB-AP Software Debug Access</description>
          <addressOffset>0x808</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_CODE</name>
              <description>APB SWD-AP: 12345678h</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>APB DAP is not allowed. Reading back register will be read as 5h</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Value to write to enable APB SWD access. Reading back register will be read as Ah</description>
                  <value>0x12345678</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SWD_ACCESS_AHBAP</name>
          <description>AHB-AP Software Debug Access</description>
          <addressOffset>0x80C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_CODE</name>
              <description>AHB SWD-AP: 12345678h</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>AHB DAP is not allowed. Reading back register will be read as 5h</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Value to write to enable AHB SWD access. Reading back register will be read as Ah</description>
                  <value>0x12345678</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
