Masmiseim36/nxpSDK/devices/MIMXRT735S/MIMXRT735S_cm33_core1.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>JPGDECWRP</name>
      <description>JPGDECWRP</description>
      <groupName>JPGDECWRP</groupName>
      <baseAddress>0x400A6000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x4FFFF</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>GLB_CTRL</name>
          <description>Global Control</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>JPG_DEC_EN</name>
              <description>JPEGDEC and JPGDECWRP Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SFTRST</name>
              <description>Engine Soft Reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFF</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOFT_RESET</name>
                  <description>Performs a soft reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEC_GO</name>
              <description>Start Decoding</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DECODING</name>
                  <description>Do not start decoding manually.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECODING</name>
                  <description>Starts decoding manually.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>L_ENDIAN</name>
              <description>Little-Endian Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Big-Endian</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Little-Endian</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLOT_EN</name>
              <description>Slots Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLOT_DIS</name>
                  <description>Disables all slots.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLOT0_EN</name>
                  <description>Enables SLOT0.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLOT1_EN</name>
                  <description>Enables SLOT1.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLOT2_EN</name>
                  <description>Enables SLOT2.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLOT3_EN</name>
                  <description>Enables SLOT3.</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>COM_STATUS</name>
          <description>Common Status</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CUR_SLOT</name>
              <description>Current Slot</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DEC_ONGOING</name>
              <description>Decoding Ongoing</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_BUF_BASE0</name>
          <description>Output Image Frame Buffer0 Base Address</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OUT_BUF_BASE0</name>
              <description>Pixel Frame Buffer0 Base</description>
              <bitOffset>4</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_BUF_BASE1</name>
          <description>Output Image Frame Buffer1 Base Address</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OUT_BUF_BASE1</name>
              <description>Pixel Frame Buffer1 Base</description>
              <bitOffset>4</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_PITCH</name>
          <description>Image Output Buffer Pitch</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OUT_PITCH</name>
              <description>Output Image Pitch</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STM_BUFBASE</name>
          <description>Input JPEG Stream Buffer Base Address</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STM_BUFBASE</name>
              <description>Bit Stream Buffer Base</description>
              <bitOffset>4</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STM_BUFSIZE</name>
          <description>Input JPEG Stream Buffer Size</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STM_BUFSIZE</name>
              <description>Bit Stream Buffer Size</description>
              <bitOffset>10</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMGSIZE</name>
          <description>Image Resolution</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IMG_HEIGHT</name>
              <description>Image Height</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IMG_WIDTH</name>
              <description>Image Width</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STM_CTRL</name>
          <description>Bit Stream and Switching Control</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIXEL_PRECISION</name>
              <description>Pixel Precision</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRECIS_8</name>
                  <description>8-bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRECIS_12</name>
                  <description>12-bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IMAGE_FORMAT</name>
              <description>Image Format</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IMAGE0</name>
                  <description>YUV420 (2-planar, Y at the first planar, and UV at the second planar)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IMAGE1</name>
                  <description>YUV422 (1-planar in the YUYV sequence)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IMAGE2</name>
                  <description>RGB (BGRBGR packed format)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IMAGE3</name>
                  <description>YUV444 (first planar in the YUVYUV sequence)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IMAGE4</name>
                  <description>Gray (Y8 or Y12) or single component</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IMAGE6</name>
                  <description>ARGB</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BITBUF_PTR_CLR</name>
              <description>Bit Buffer Pointer Clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESTORE</name>
                  <description>Restores the bit stream buffer pointer from the save pointer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Clears the bit stream buffer pointer from the save pointer.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUTO_START</name>
              <description>Auto Start</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GO_NO</name>
                  <description>Do not write 1 to CTRL[GO] in JPEGDEC.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GO_YES</name>
                  <description>Writes 1 to CTRL[GO] in JPEGDEC.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>4</dim>
          <dimIncrement>0x200</dimIncrement>
          <name>SLOT_REGS[%s]</name>
          <description>Bit Stream Slot</description>
          <addressOffset>0x200</addressOffset>
          <register>
            <name>SLOT_STATUS</name>
            <description>Bit Stream Status</description>
            <addressOffset>0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>STMBUF_HALF</name>
                <description>Stream Buffer Half Flag</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
                <enumeratedValues>
                  <usage>read</usage>
                  <enumeratedValue>
                    <name>STMBUF_NOT_PASS_HALF</name>
                    <description>The bit stream buffer pointer for the current slot has not passed half of the buffer size.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STMBUF_PASS_HALF</name>
                    <description>The bit stream buffer pointer for the current slot passed half of the buffer size.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>STMBUF_RTND</name>
                <description>Stream Buffer Returned Flag</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
                <enumeratedValues>
                  <usage>read</usage>
                  <enumeratedValue>
                    <name>STMBUF_NOT_PASS_TOP</name>
                    <description>The bit stream buffer pointer for the current slot has not passed the top mark of the buffer.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STMBUF_PASS_TOP</name>
                    <description>The bit stream buffer pointer for the current slot passed the top mark of the buffer.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SWITCHED_IN</name>
                <description>Switched In Flag</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
                <enumeratedValues>
                  <usage>read</usage>
                  <enumeratedValue>
                    <name>SLOT_NOT_SWITCHED</name>
                    <description>The current slot is not switched in during context switching.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SLOT_SWITCHED</name>
                    <description>The current slot is switched in during context switching.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FRMDONE</name>
                <description>Frame Done Flag</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
                <enumeratedValues>
                  <usage>read</usage>
                  <enumeratedValue>
                    <name>DECODING_NOT_COMP</name>
                    <description>Decoding is not completed.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DECODING_COMP</name>
                    <description>Decoding is completed.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DECERR</name>
                <description>Decoding Error Flag</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
                <enumeratedValues>
                  <usage>read</usage>
                  <enumeratedValue>
                    <name>NO_DECODING_ERROR</name>
                    <description>No decoding error occurred.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DECODING_ERROR</name>
                    <description>A decoding error occurred.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DES_RD_ERR</name>
                <description>Descriptor Read Error Flag</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
                <enumeratedValues>
                  <usage>read</usage>
                  <enumeratedValue>
                    <name>NO_DESC_READ_ERROR</name>
                    <description>No descriptor read error occurred.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DESC_READ_ERROR</name>
                    <description>A descriptor read error occurred.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BIT_RD_ERR</name>
                <description>Bit Read Error Flag</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
                <enumeratedValues>
                  <usage>read</usage>
                  <enumeratedValue>
                    <name>NO_BIT_ERR</name>
                    <description>No bit read error occurred.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BIT_ERR</name>
                    <description>A bit read error occurred.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PIXEL_WT_ERR</name>
                <description>Pixel Write Error Flag</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
                <enumeratedValues>
                  <usage>read</usage>
                  <enumeratedValue>
                    <name>NO_PIXEL_ERROR</name>
                    <description>No pixel write error occurred.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PIXEL_ERROR</name>
                    <description>A pixel write error occurred.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CUR_SLOT</name>
                <description>Current Slot</description>
                <bitOffset>29</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DEC_ONGOING</name>
                <description>Decoding Ongoing</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PAUSE_STOP</name>
                    <description>Paused or stopped</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ONGOING</name>
                    <description>Ongoing</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
