Masmiseim36/nxpSDK/devices/MIMXRT735S/MIMXRT735S_cm33_core1.xml
        <register>
          <name>PDRUNCFG2</name>
          <description>PD Run Configuration 2 in Sense Domain</description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFE</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRAM0</name>
              <description>Power Down RAM Partition 0 Array</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Array power on, periphery power controlled by PD*CFG3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM1</name>
              <description>Power Down RAM Partition 1 Array</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Array power on, periphery power controlled by PD*CFG3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM2</name>
              <description>Power Down RAM Partition 2 Array</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Array power on, periphery power controlled by PD*CFG3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM3</name>
              <description>Power Down RAM Partition 3 Array</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Array power on, periphery power controlled by PD*CFG3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM4</name>
              <description>Power Down RAM Partition 4 Array</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Array power on, periphery power controlled by PD*CFG3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM5</name>
              <description>Power Down RAM Partition 5 Array</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Array power on, periphery power controlled by PD*CFG3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM6</name>
              <description>Power Down RAM Partition 6 Array</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Array power on, periphery power controlled by PD*CFG3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM7</name>
              <description>Power Down RAM Partition 7 Array</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Array power on, periphery power controlled by PD*CFG3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM8</name>
              <description>Power Down RAM Partition 8 Array</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Array power on, periphery power controlled by PD*CFG3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM9</name>
              <description>Power Down RAM Partition 9 Array</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Array power on, periphery power controlled by PD*CFG3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM10</name>
              <description>Power Down RAM Partition 10 Array</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Array power on, periphery power controlled by PD*CFG3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM11</name>
              <description>Power Down RAM Partition 11 Array</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Array power on, periphery power controlled by PD*CFG3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM12</name>
              <description>Power Down RAM Partition 12 Array</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Array power on, periphery power controlled by PD*CFG3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM13</name>
              <description>Power Down RAM Partition 13 Array</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Array power on, periphery power controlled by PD*CFG3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM14</name>
              <description>Power Down RAM Partition 14 Array</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Array power on, periphery power controlled by PD*CFG3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM15</name>
              <description>Power Down RAM Partition 15 Array</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Array power on, periphery power controlled by PD*CFG3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM16</name>
              <description>Power Down RAM Partition 16 Array</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Array power on, periphery power controlled by PD*CFG3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM17</name>
              <description>Power Down RAM Partition 17 Array</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Array power on, periphery power controlled by PD*CFG3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM18</name>
              <description>Power Down RAM Partition 18 Array</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Array power on, periphery power controlled by PD*CFG3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM19</name>
              <description>Power Down RAM Partition 19 Array</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Array power on, periphery power controlled by PD*CFG3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM20</name>
              <description>Power Down RAM Partition 20 Array</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Array power on, periphery power controlled by PD*CFG3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM21</name>
              <description>Power Down RAM Partition 21 Array</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Array power on, periphery power controlled by PD*CFG3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM22</name>
              <description>Power Down RAM Partition 22 Array</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Array power on, periphery power controlled by PD*CFG3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM23</name>
              <description>Power Down RAM Partition 23 Array</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Array power on, periphery power controlled by PD*CFG3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM24</name>
              <description>Power Down RAM Partition 24 Array</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Array power on, periphery power controlled by PD*CFG3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM25</name>
              <description>Power Down RAM Partition 25 Array</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Array power on, periphery power controlled by PD*CFG3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM26</name>
              <description>Power Down RAM Partition 26 Array</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Array power on, periphery power controlled by PD*CFG3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM27</name>
              <description>Power Down RAM Partition 27 Array</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Array power on, periphery power controlled by PD*CFG3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM28</name>
              <description>Power Down RAM Partition 28 Array</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Array power on, periphery power controlled by PD*CFG3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM29</name>
              <description>Power Down RAM Partition 29 Array</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARR_ON</name>
                  <description>Array power on, periphery power controlled by PD*CFG3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARR_PER_OFF</name>
                  <description>Power down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
