Masmiseim36/nxpSDK/devices/MIMXRT735S/MIMXRT735S_cm33_core1.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="LPUART17">
      <name>LPUART18</name>
      <description>LPUART</description>
      <alternatePeripheral>LPSPI18</alternatePeripheral>
      <groupName>LPUART</groupName>
      <baseAddress>0x40327000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x800</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_FLEXCOMM18</name>
        <value>12</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPUART17">
      <name>LPUART19</name>
      <description>LPUART</description>
      <alternatePeripheral>LPSPI19</alternatePeripheral>
      <groupName>LPUART</groupName>
      <baseAddress>0x40328000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x800</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_FLEXCOMM19</name>
        <value>13</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPUART17">
      <name>LPUART20</name>
      <description>LPUART</description>
      <alternatePeripheral>LPSPI20</alternatePeripheral>
      <groupName>LPUART</groupName>
      <baseAddress>0x40329000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x800</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_FLEXCOMM20</name>
        <value>14</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>LP_FLEXCOMM17</name>
      <description>Low-Power Flexible Communications Interface</description>
      <alternatePeripheral>LPSPI17</alternatePeripheral>
      <groupName>LP_FLEXCOMM</groupName>
      <headerStructName>LP_FLEXCOMM</headerStructName>
      <baseAddress>0x40326000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xFFC</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_FLEXCOMM17</name>
        <value>11</value>
      </interrupt>
      <registers>
        <register>
          <name>ISTAT</name>
          <description>Interrupt Status</description>
          <addressOffset>0xFF4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UARTTX</name>
              <description>UART TX Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <description>Clear</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>Set</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UARTRX</name>
              <description>UART RX Interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <description>Clear</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>Set</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPI</name>
              <description>SPI Interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <description>Clear</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>Set</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2CM</name>
              <description>I2C Controller Interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <description>Clear</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>Set</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2CS</name>
              <description>I2C Subordinate Interrupt</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <description>Clear</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>Set</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PSELID</name>
          <description>Peripheral Select and ID</description>
          <addressOffset>0xFF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x103070</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PERSEL</name>
              <description>Peripheral Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No peripheral selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART</name>
                  <description>UART</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI</name>
                  <description>SPI</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C</name>
                  <description>I2C</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UARTI2C</name>
                  <description>UART and I2C</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK</name>
              <description>Lock</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FALSE</name>
                  <description>PERSEL is writable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRUE</name>
                  <description>PERSEL is not writable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UARTPRESENT</name>
              <description>UART Present</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FALSE</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRUE</name>
                  <description>Supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPIPRESENT</name>
              <description>SPI Present</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FALSE</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRUE</name>
                  <description>Supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2CPRESENT</name>
              <description>I2C Present</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FALSE</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRUE</name>
                  <description>Supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ID</name>
              <description>LP_FLEXCOMM interface ID</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
