Masmiseim36/nxpSDK/devices/MIMXRT735S/MIMXRT735S_cm33_core1.xml
        <cluster>
          <dim>5</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>XSPI2_REGION1_5_MEM_RULE[%s]</name>
          <description>Array of registers: XSPI2_REGION_MEM_RULE0</description>
          <addressOffset>0x270</addressOffset>
          <register>
            <name>XSPI2_REGION_MEM_RULE0</name>
            <description>XSPI2 Region index Memory Rule Register</description>
            <addressOffset>0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RULE0</name>
                <description>Rule 0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                    <description>Non-secure and non-privilege user access allowed</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NONSECURE_PRIV_USER_ALLOWED</name>
                    <description>Non-secure and privilege access allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SECURE_NONPRIV_USER_ALLOWED</name>
                    <description>Secure and non-privilege user access allowed</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SECURE_PRIV_USER_ALLOWED</name>
                    <description>Secure and privilege user access allowed</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RULE1</name>
                <description>Rule 1</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                    <description>Non-secure and non-privilege user access allowed</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NONSECURE_PRIV_USER_ALLOWED</name>
                    <description>Non-secure and privilege access allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SECURE_NONPRIV_USER_ALLOWED</name>
                    <description>Secure and non-privilege user access allowed</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SECURE_PRIV_USER_ALLOWED</name>
                    <description>Secure and privilege user access allowed</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RULE2</name>
                <description>Rule 2</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                    <description>Non-secure and non-privilege user access allowed</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NONSECURE_PRIV_USER_ALLOWED</name>
                    <description>Non-secure and privilege access allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SECURE_NONPRIV_USER_ALLOWED</name>
                    <description>Secure and non-privilege user access allowed</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SECURE_PRIV_USER_ALLOWED</name>
                    <description>Secure and privilege user access allowed</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RULE3</name>
                <description>Rule 3</description>
                <bitOffset>12</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                    <description>Non-secure and non-privilege user access allowed</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NONSECURE_PRIV_USER_ALLOWED</name>
                    <description>Non-secure and privilege access allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SECURE_NONPRIV_USER_ALLOWED</name>
                    <description>Secure and non-privilege user access allowed</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SECURE_PRIV_USER_ALLOWED</name>
                    <description>Secure and privilege user access allowed</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RULE4</name>
                <description>Rule 4</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                    <description>Non-secure and non-privilege user access allowed</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NONSECURE_PRIV_USER_ALLOWED</name>
                    <description>Non-secure and privilege access allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SECURE_NONPRIV_USER_ALLOWED</name>
                    <description>Secure and non-privilege user access allowed</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SECURE_PRIV_USER_ALLOWED</name>
                    <description>Secure and privilege user access allowed</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RULE5</name>
                <description>Rule 5</description>
                <bitOffset>20</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                    <description>Non-secure and non-privilege user access allowed</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NONSECURE_PRIV_USER_ALLOWED</name>
                    <description>Non-secure and privilege access allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SECURE_NONPRIV_USER_ALLOWED</name>
                    <description>Secure and non-privilege user access allowed</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SECURE_PRIV_USER_ALLOWED</name>
                    <description>Secure and privilege user access allowed</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RULE6</name>
                <description>Rule 6</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                    <description>Non-secure and non-privilege user access allowed</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NONSECURE_PRIV_USER_ALLOWED</name>
                    <description>Non-secure and privilege access allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SECURE_NONPRIV_USER_ALLOWED</name>
                    <description>Secure and non-privilege user access allowed</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SECURE_PRIV_USER_ALLOWED</name>
                    <description>Secure and privilege user access allowed</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RULE7</name>
                <description>Rule 7</description>
                <bitOffset>28</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                    <description>Non-secure and non-privilege user access allowed</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NONSECURE_PRIV_USER_ALLOWED</name>
                    <description>Non-secure and privilege access allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SECURE_NONPRIV_USER_ALLOWED</name>
                    <description>Secure and non-privilege user access allowed</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SECURE_PRIV_USER_ALLOWED</name>
                    <description>Secure and privilege user access allowed</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <dim>13</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SEC_VIO_ADDR[%s]</name>
          <description>Security Violation Address</description>
          <addressOffset>0xE00</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_VIO_ADDR</name>
              <description>Security violation address for AHB layer a reset value 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>13</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SEC_VIO_MISC_INFO[%s]</name>
          <description>Security Violation Miscellaneous Information at Address</description>
          <addressOffset>0xE80</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEC_VIO_INFO_WRITE</name>
              <description>Security violation access read/write indicator</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE</name>
                  <description>Write access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC_VIO_INFO_DATA_ACCESS</name>
              <description>Security Violation Info Data Access</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CODE</name>
                  <description>Code</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA</name>
                  <description>Data</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC_VIO_INFO_MASTER_SEC_LEVEL</name>
              <description>Security Violation Info Master Security Level</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEC_VIO_INFO_MASTER</name>
              <description>Security violation master number</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU0_SYS</name>
                  <description>CPU0 System</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0</name>
                  <description>eDMA0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1</name>
                  <description>eDMA1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ELS</name>
                  <description>ELS</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIFI4</name>
                  <description>HIFI4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU1_SYS</name>
                  <description>CPU1 system</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2</name>
                  <description>eDMA2</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA3</name>
                  <description>eDMA3</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIFI1</name>
                  <description>HIFI1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EZH</name>
                  <description>EZH-V</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PKC</name>
                  <description>PKC</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMMC0</name>
                  <description>USDHC0</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USBHS</name>
                  <description>USB0</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPU</name>
                  <description>GPU</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ETR</name>
                  <description>ETR</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAP</name>
                  <description>DAP</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU0_CODE</name>
                  <description>CPU0 Code</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU1_CODE</name>
                  <description>CPU1 code</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JPEG</name>
                  <description>JPEGDEC</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PNG</name>
                  <description>PNGDEC</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMMC1</name>
                  <description>USDHC1</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USBE</name>
                  <description>USB1</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDIF</name>
                  <description>LCDIF</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MTR</name>
                  <description>MTR</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_PORT</name>
                  <description>Test port</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
