Masmiseim36/nxpSDK/devices/MIMXRT735S/MIMXRT735S_cm33_core1.xml
        <register>
          <name>PROT_CTRL</name>
          <description>Protocol Control</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8800020</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DTW</name>
              <description>Data transfer width</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DTW_C</name>
                  <description>1-bit mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTW_B</name>
                  <description>4-bit mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTW_A</name>
                  <description>8-bit mode</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>D3CD</name>
              <description>DATA3 as card detection pin</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>D3CD_B</name>
                  <description>DATA3 does not monitor card insertion</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D3CD_A</name>
                  <description>DATA3 as card detection pin</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMODE</name>
              <description>Endian mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMODE_A</name>
                  <description>Big endian mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMODE_B</name>
                  <description>Half word big endian mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMODE_C</name>
                  <description>Little endian mode</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMASEL</name>
              <description>DMA select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMASEL_A</name>
                  <description>No DMA or simple DMA is selected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMASEL_b</name>
                  <description>ADMA1 is selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMASEL_C</name>
                  <description>ADMA2 is selected.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SABGREQ</name>
              <description>Stop at block gap request</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SABGREQ_b</name>
                  <description>Transfer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SABGREQ_A</name>
                  <description>Stop</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CREQ</name>
              <description>Continue request</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CREQ_B</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CREQ_A</name>
                  <description>Restart</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RWCTL</name>
              <description>Read wait control</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RWCTL_b</name>
                  <description>Disables read wait control and stop SD clock at block gap when SABGREQ field is set</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RWCTL_A</name>
                  <description>Enables read wait control and assert read wait without stopping SD clock at block gap when SABGREQ field is set</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IABG</name>
              <description>Interrupt at block gap</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IABG_b</name>
                  <description>Disables interrupt at block gap</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IABG_A</name>
                  <description>Enables interrupt at block gap</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RD_DONE_NO_8CLK</name>
              <description>Read performed number 8 clock</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WECINT</name>
              <description>Wakeup event enable on card interrupt</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WECINT_A</name>
                  <description>Disables wakeup event enable on card interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WECINT_b</name>
                  <description>Enables wakeup event enable on card interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WECINS</name>
              <description>Wakeup event enable on SD card insertion</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WECINS_b</name>
                  <description>Disable wakeup event enable on SD card insertion</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WECINS_A</name>
                  <description>Enable wakeup event enable on SD card insertion</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WECRM</name>
              <description>Wakeup event enable on SD card removal</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WECRM_B</name>
                  <description>Disables wakeup event enable on SD card removal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WECRM_A</name>
                  <description>Enables wakeup event enable on SD card removal</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NON_EXACT_BLK_RD</name>
              <description>Non-exact block read</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXACT_B</name>
                  <description>The block read is exact block read. Host driver does not need to issue abort command to terminate this multi-block read.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXACT_A</name>
                  <description>The block read is non-exact block read. Host driver needs to issue abort command to terminate this multi-block read.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYS_CTRL</name>
          <description>System Control</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80800F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DVS</name>
              <description>Divisor</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DVS_A</name>
                  <description>Divide-by-1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DVS_B</name>
                  <description>Divide-by-2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DVS_C</name>
                  <description>Divide-by-15</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DVS_D</name>
                  <description>Divide-by-16</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDCLKFS</name>
              <description>SDCLK frequency select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTOCV</name>
              <description>Data timeout counter value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DTOCV_X</name>
                  <description>SDCLK x 2 32</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_W</name>
                  <description>SDCLK x 2 33</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_V</name>
                  <description>SDCLK x 2 18</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_U</name>
                  <description>SDCLK x 2 19</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_T</name>
                  <description>SDCLK x 2 29, recommend to use for supported speed modes except HS200, HS400, SDR104 mode</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_S</name>
                  <description>SDCLK x 2 30, recommend to use for HS200 and SDR104 mode</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTOCV_R</name>
                  <description>SDCLK x 2 31, recommend to use for HS400 mode</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RST_FIFO</name>
              <description>Reset the async FIFO</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPP_RST_N</name>
              <description>Hardware reset</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTA</name>
              <description>Software reset for all</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RSTA_B</name>
                  <description>No reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSTA_A</name>
                  <description>Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSTC</name>
              <description>Software reset for CMD line</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RSTC_B</name>
                  <description>No reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSTC_A</name>
                  <description>Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSTD</name>
              <description>Software reset for data line</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RSTD_B</name>
                  <description>No reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSTD_A</name>
                  <description>Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INITA</name>
              <description>Initialization active</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTT</name>
              <description>Reset tuning</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
