Masmiseim36/nxpSDK/devices/MIMXRT735S/MIMXRT735S_cm33_core1.xml
        <register>
          <name>USB1_LOOPBACK_HSFSCNT_TOG</name>
          <description>USBPHY Loopback Packet Number Selection</description>
          <addressOffset>0x12C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40010</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToToggle</modifiedWriteValues>
          <fields>
            <field>
              <name>TSTI_HS_NUMBER</name>
              <description>Loopback Test HS Packet Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>TSTI_FS_NUMBER</name>
              <description>Loopback Test FS Packet Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIM_OVERRIDE_EN</name>
          <description>USBPHY Trim Override Enable</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIM_DIV_SEL_OVERRIDE</name>
              <description>Override Enable for PLL Divider Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIM_ENV_TAIL_ADJ_VD_OVERRIDE</name>
              <description>Override Enable for HS RX Squelch Rise Time Delay Trim</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIM_TX_D_CAL_OVERRIDE</name>
              <description>Override Enable for the HS TX Output Current Trim</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIM_TX_CAL45DP_OVERRIDE</name>
              <description>Override Enable for DP Series Termination Trim</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIM_TX_CAL45DN_OVERRIDE</name>
              <description>Override Enable for DN Series Termination Trim</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIM_REFBIAS_VBGADJ_OVERRIDE</name>
              <description>Override Enable for Bandgap Voltage Adjustment</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIM_REFBIAS_TST_OVERRIDE</name>
              <description>Override Enable for Bias Current Control</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIM_USB2_REFBIAS_VBGADJ</name>
              <description>Bandgap Voltage Adjustment Bits from Outside USBPHY</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TRIM_USB2_REFBIAS_TST</name>
              <description>Bias Current Control Adjustment Bits from Outside USBPHY</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TRIM_PLL_CTRL0_DIV_SEL</name>
              <description>PLL Divider Value Configuration Bits from Outside USBPHY</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TRIM_USB_REG_ENV_TAIL_ADJ_VD</name>
              <description>HS RX Squelch Rise Time Delay Trim Bits from Outside USBPHY</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TRIM_USBPHY_TX_D_CAL</name>
              <description>HS TX Output Current Trim Bits from Outside USBPHY</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAX</name>
                  <description>Maximum current; approximately 19% above nominal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOM</name>
                  <description>Nominal</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MIN</name>
                  <description>Minimum current; approximately 19% below nominal</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIM_USBPHY_TX_CAL45DP</name>
              <description>DP Series Termination Resistance Trim Bits from Outside USBPHY</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TRIM_USBPHY_TX_CAL45DN</name>
              <description>DN Series Termination Resistance Trim Bits from Outside USBPHY</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIM_OVERRIDE_EN_SET</name>
          <description>USBPHY Trim Override Enable</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToSet</modifiedWriteValues>
          <fields>
            <field>
              <name>TRIM_DIV_SEL_OVERRIDE</name>
              <description>Override Enable for PLL Divider Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>TRIM_ENV_TAIL_ADJ_VD_OVERRIDE</name>
              <description>Override Enable for HS RX Squelch Rise Time Delay Trim</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>TRIM_TX_D_CAL_OVERRIDE</name>
              <description>Override Enable for the HS TX Output Current Trim</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>TRIM_TX_CAL45DP_OVERRIDE</name>
              <description>Override Enable for DP Series Termination Trim</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>TRIM_TX_CAL45DN_OVERRIDE</name>
              <description>Override Enable for DN Series Termination Trim</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>TRIM_REFBIAS_VBGADJ_OVERRIDE</name>
              <description>Override Enable for Bandgap Voltage Adjustment</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>TRIM_REFBIAS_TST_OVERRIDE</name>
              <description>Override Enable for Bias Current Control</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>TRIM_USB2_REFBIAS_VBGADJ</name>
              <description>Bandgap Voltage Adjustment Bits from Outside USBPHY</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>TRIM_USB2_REFBIAS_TST</name>
              <description>Bias Current Control Adjustment Bits from Outside USBPHY</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>TRIM_PLL_CTRL0_DIV_SEL</name>
              <description>PLL Divider Value Configuration Bits from Outside USBPHY</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>TRIM_USB_REG_ENV_TAIL_ADJ_VD</name>
              <description>HS RX Squelch Rise Time Delay Trim Bits from Outside USBPHY</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>TRIM_USBPHY_TX_D_CAL</name>
              <description>HS TX Output Current Trim Bits from Outside USBPHY</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>TRIM_USBPHY_TX_CAL45DP</name>
              <description>DP Series Termination Resistance Trim Bits from Outside USBPHY</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>TRIM_USBPHY_TX_CAL45DN</name>
              <description>DN Series Termination Resistance Trim Bits from Outside USBPHY</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIM_OVERRIDE_EN_CLR</name>
          <description>USBPHY Trim Override Enable</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>TRIM_DIV_SEL_OVERRIDE</name>
              <description>Override Enable for PLL Divider Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TRIM_ENV_TAIL_ADJ_VD_OVERRIDE</name>
              <description>Override Enable for HS RX Squelch Rise Time Delay Trim</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TRIM_TX_D_CAL_OVERRIDE</name>
              <description>Override Enable for the HS TX Output Current Trim</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TRIM_TX_CAL45DP_OVERRIDE</name>
              <description>Override Enable for DP Series Termination Trim</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TRIM_TX_CAL45DN_OVERRIDE</name>
              <description>Override Enable for DN Series Termination Trim</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TRIM_REFBIAS_VBGADJ_OVERRIDE</name>
              <description>Override Enable for Bandgap Voltage Adjustment</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TRIM_REFBIAS_TST_OVERRIDE</name>
              <description>Override Enable for Bias Current Control</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TRIM_USB2_REFBIAS_VBGADJ</name>
              <description>Bandgap Voltage Adjustment Bits from Outside USBPHY</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TRIM_USB2_REFBIAS_TST</name>
              <description>Bias Current Control Adjustment Bits from Outside USBPHY</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TRIM_PLL_CTRL0_DIV_SEL</name>
              <description>PLL Divider Value Configuration Bits from Outside USBPHY</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TRIM_USB_REG_ENV_TAIL_ADJ_VD</name>
              <description>HS RX Squelch Rise Time Delay Trim Bits from Outside USBPHY</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TRIM_USBPHY_TX_D_CAL</name>
              <description>HS TX Output Current Trim Bits from Outside USBPHY</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TRIM_USBPHY_TX_CAL45DP</name>
              <description>DP Series Termination Resistance Trim Bits from Outside USBPHY</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TRIM_USBPHY_TX_CAL45DN</name>
              <description>DN Series Termination Resistance Trim Bits from Outside USBPHY</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
